// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
//A (3,6); B (2,1) -> 5,09 
//A (7,-5); B (1,-1) -> 7,21

// для первой прямой
Console.WriteLine("Введите х-координату первой прямой: ");
double X1 = Convert.ToInt(Console.ReadLine());
Console.WriteLine("Введите Y-координату первой прямой: ");
double Y1 = Convert.ToInt(Console.ReadLine);

//для второй прямой
Console.WriteLine("Введите х-координату второй прямой: ");
double X2 = Convert.ToInt(Console.ReadLine());
Console.WriteLine("Введите Y-координату второй прямой: ");
double Y2 = Convert.ToInt(Console.ReadLine);

// расстояние
double rast

